IDENTIFICATION DIVISION.
PROGRAM-ID. VTEST-FSTPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
    
    01 WSC-CONSTANTES.
        05 WSC-EDAD-MINIMA PIC 99 VALUE 18.
        05 WSC-ESTADO-SECUND PIC X VALUE 'T'.
        05 WSC-ESTADO-CARRERA-OK.
            10 WSC-TERMINADO PIC X VALUE 'T'.
            10 WSC-ENCURSO   PIC X VALUE 'C'.
            
    01 WSV-VARIABLES.
        05 WS-POSTULANTES.
            10 WSV-POSTULANTE1.
                15 WSV-NOMBRE1 PIC X(5) VALUE 'PEDRO'.
                15 WSV-EDAD1 PIC 99 VALUE 15.
                15 WSV-SECUNDARIO1 PIC X VALUE 'N'.
                15 WSV-CARRERA1 PIC X VALUE 'N'.
            10 WSV-POSTULANTE2.
                15 WSV-NOMBRE2 PIC X(5) VALUE 'SOFIA'.
                15 WSV-EDAD2 PIC 99 VALUE 25.
                15 WSV-SECUNDARIO2 PIC X VALUE 'T'.
                15 WSV-CARRERA2 PIC X VALUE 'T'.
            10 WSV-POSTULANTE3.
                15 WSV-NOMBRE3 PIC X(5) VALUE 'LALA'.
                15 WSV-EDAD3 PIC 99 VALUE 19.
                15 WSV-SECUNDARIO3 PIC X VALUE 'T'.
                15 WSV-CARRERA3 PIC X VALUE 'C'.
        05 WSV-POSTULANTE-AUX.
            10 WSV-NOMBRE_AUX PIC X(5).
            10 WSV-EDAD_AUX PIC 99.
            10 WSV-SECUNDARIO_AUX PIC X.
            10 WSV-CARRERA_AUX PIC X.

PROCEDURE DIVISION.
00-CONTROL.
    DISPLAY 'INICIANDO EN COBOL'.
    DISPLAY '__________________________________________'.
    
    MOVE WSV-POSTULANTE1 TO WSV-POSTULANTE-AUX.
    PERFORM 20-EVALUAR.
    
    MOVE WSV-POSTULANTE2 TO WSV-POSTULANTE-AUX.
    PERFORM 20-EVALUAR.
    
    MOVE WSV-POSTULANTE3 TO WSV-POSTULANTE-AUX.
    PERFORM 20-EVALUAR.
    
STOP RUN.
00-CONTROL-END.
EXIT.

20-EVALUAR.
    IF (WSV-EDAD_AUX >= WSC-EDAD-MINIMA AND
        WSV-SECUNDARIO_AUX EQUAL WSC-ESTADO-SECUND AND
        (WSV-CARRERA_AUX EQUAL WSC-TERMINADO OR WSV-CARRERA_AUX EQUAL WSC-ENCURSO))
        DISPLAY WSV-NOMBRE_AUX ' CUMPLE'
    ELSE 
        DISPLAY WSV-NOMBRE_AUX ' NO CUMPLE'
    END-IF.
    
    DISPLAY '__________________________________________'.
    
    INITIALIZE WSV-POSTULANTE-AUX.
20-EVALUAR-END.
EXIT.